app/controllers/posts_controller.rb

  def create
    #'C' in the 'CRUD' life cycle — saves a new Post object and then redirects to the newly-created post's show page.
    @post = Post.new
    @post.title = params[:title]
    @post.description = params[:description]
    @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2015-12-31 19:45:52.559860"], ["updated_at", "2015-12-31 19:45:52.559860"]]